In [1]:
import pandas as pd

In [2]:
p = {"a":[1,2], "b":[3,4]}
q = {"c":[5,6], "d":[7,8]}
r = {"e":[9,10], "f":[11,12]}

In [3]:
df_1 = pd.DataFrame(p, index=["id1", "id2"])
df_2 = pd.DataFrame(q, index=["id1", "id2"])

# INDEX values are same

#### No impact for arument "how"

In [4]:
df_1

     a  b
id1  1  3
id2  2  4

In [5]:
df_2

     c  d
id1  5  7
id2  6  8

In [6]:
df_1.join(df_2)

     a  b  c  d
id1  1  3  5  7
id2  2  4  6  8

In [7]:
df_1.join(df_2, how="left")

     a  b  c  d
id1  1  3  5  7
id2  2  4  6  8

In [8]:
df_1.join(df_2, how="right")

     a  b  c  d
id1  1  3  5  7
id2  2  4  6  8

In [9]:
df_1.join(df_2, how="inner")

     a  b  c  d
id1  1  3  5  7
id2  2  4  6  8

In [10]:
df_1.join(df_2, how="outer")

     a  b  c  d
id1  1  3  5  7
id2  2  4  6  8

# INDEX values are different

#### One Index kept common

In [11]:
df_1 = pd.DataFrame(p, index=["id1", "id2"])
df_2 = pd.DataFrame(q, index=["id1", "id3"])
df_3 = pd.DataFrame(r, index=["id4", "id5"])

In [12]:
df_1

     a  b
id1  1  3
id2  2  4

In [13]:
df_2

     c  d
id1  5  7
id3  6  8

In [14]:
df_3

      e   f
id4   9  11
id5  10  12

#### By default how="left"

In [15]:
df_1.join(df_2)

     a  b    c    d
id1  1  3  5.0  7.0
id2  2  4  NaN  NaN

#### how="left"

Left DataFrame will be taken.If any Index is in common from Right DataFrame that will be considered. All columns will be considered

In [16]:
df_1.join(df_2, how="left")  # id1 is common from RIGHT

     a  b    c    d
id1  1  3  5.0  7.0
id2  2  4  NaN  NaN

In [17]:
df_1.join(df_3, how="left") # No index is common from RIGHT

     a  b   e   f
id1  1  3 NaN NaN
id2  2  4 NaN NaN

#### how="right"

Right DataFrame will be taken.If any Index is in common from Left DataFrame that will be considered. All columns will be considered

In [18]:
df_1

     a  b
id1  1  3
id2  2  4

In [19]:
df_2

     c  d
id1  5  7
id3  6  8

In [20]:
df_3

      e   f
id4   9  11
id5  10  12

In [21]:
df_1.join(df_2, how="right")

       a    b  c  d
id1  1.0  3.0  5  7
id3  NaN  NaN  6  8

In [22]:
df_1.join(df_3, how="right")

      a   b   e   f
id4 NaN NaN   9  11
id5 NaN NaN  10  12

#### how="inner"

Only If any Common Index is available in between DataFrames, that will be considered. All columns will be considered

In [24]:
df_1

     a  b
id1  1  3
id2  2  4

In [25]:
df_2

     c  d
id1  5  7
id3  6  8

In [26]:
df_3

      e   f
id4   9  11
id5  10  12

In [27]:
df_1.join(df_2, how="inner")

     a  b  c  d
id1  1  3  5  7

In [28]:
df_1.join(df_3, how="inner")

Empty DataFrame
Columns: [a, b, e, f]
Index: []

#### how="outer"

All ROWs and Columns will be considered

In [29]:
df_1

     a  b
id1  1  3
id2  2  4

In [30]:
df_2

     c  d
id1  5  7
id3  6  8

In [31]:
df_3

      e   f
id4   9  11
id5  10  12

In [32]:
df_1.join(df_2, how="outer")

       a    b    c    d
id1  1.0  3.0  5.0  7.0
id2  2.0  4.0  NaN  NaN
id3  NaN  NaN  6.0  8.0

In [33]:
df_1.join(df_3, how="outer")

       a    b     e     f
id1  1.0  3.0   NaN   NaN
id2  2.0  4.0   NaN   NaN
id4  NaN  NaN   9.0  11.0
id5  NaN  NaN  10.0  12.0

# If any Column is Common between DataFrames, Join will not work

In [39]:
p = {"a":[1,2], "b":[3,4]}
q = {"b":[5,6], "d":[7,8]}  #Column b is common

In [40]:
df_1 = pd.DataFrame(p, index=["id1", "id2"])
df_2 = pd.DataFrame(q, index=["id1", "id2"])

In [41]:
df_1

     a  b
id1  1  3
id2  2  4

In [42]:
df_2

     b  d
id1  5  7
id2  6  8

In [43]:
df_1.join(df_2)

ValueError: columns overlap but no suffix specified: Index(['b'], dtype='object')